{
  "backend/main.mo": "Defines survey and career types, static career data, and a function to generate career recommendations based on survey results.",
  "feature_evidence.json": "Lists feature evidence entries mapping new survey and recommendation features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries of key frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode values, and global base styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Main React app component wiring navigation, sections, and global state provider.",
  "frontend/src/components/chat/ChatComposer.tsx": "Chat input form handling text entry, Enter-to-send, and disabled/loading states.",
  "frontend/src/components/chat/ChatThread.tsx": "Displays chat messages with auto-scroll, avatars, and loading skeletons.",
  "frontend/src/components/layout/Section.tsx": "Generic section wrapper supporting decorations, muted background, and reveal animations.",
  "frontend/src/components/layout/TopNav.tsx": "Responsive top navigation bar with scroll effects, desktop links, and a collapsible mobile menu that triggers section navigation.",
  "frontend/src/components/motion/Reveal.tsx": "Wrapper component that animates children into view using intersection observer and configurable animation styles.",
  "frontend/src/components/recommendations/RecommendationCard.tsx": "Displays a single career recommendation with title, description, required skills, education, and match reasons.",
  "frontend/src/components/sections/CareerAssistantSection.tsx": "Manages the career assistant chat flow, handling states for survey completion, chat start, skipped chat, and rendering chat UI or prompts.",
  "frontend/src/components/sections/FooterSection.tsx": "Footer with branding, about text, contact link, disclaimer, and decorative elements.",
  "frontend/src/components/sections/HomeSection.tsx": "Landing section with branding, intro text, and feature cards encouraging users to start the survey.",
  "frontend/src/components/sections/RecommendationsSection.tsx": "Computes skill scores from survey answers and displays career recommendations or guidance messages based on user progress.",
  "frontend/src/components/sections/SurveySection.tsx": "Section that renders the career survey and saves answers upon completion.",
  "frontend/src/components/sections/TechnologyExplanationSection.tsx": "Presents a three-card section explaining rule-based logic, multi-criteria analysis, and AI guidance with animations and icons.",
  "frontend/src/components/survey/CareerSurvey.tsx": "Implements a multi-step career survey managing user answers, navigation, validation, and completion state.",
  "frontend/src/components/survey/steps/InterestActivitiesStep.tsx": "Renders selectable activity preferences with icons, allowing toggling of multiple choices.",
  "frontend/src/components/survey/steps/InterestsStep.tsx": "Provides a list of interest categories with icons, enabling multi-select via checkboxes.",
  "frontend/src/components/survey/steps/LearningStyleStep.tsx": "Offers radio-based selection of preferred learning styles with descriptions.",
  "frontend/src/components/survey/steps/PersonalityStep.tsx": "Displays personality trait options with descriptions, supporting multi-select behavior.",
  "frontend/src/components/survey/steps/SkillsStep.tsx": "Shows a list of skills as checkbox options for multi-selection.",
  "frontend/src/components/survey/steps/WorkEnvironmentStep.tsx": "Provides radio options for selecting a preferred work environment with descriptions.",
  "frontend/src/components/survey/steps/WorkValuesStep.tsx": "Lets users choose important work values from icon-labeled checkbox options.",
  "frontend/src/components/survey/SurveyProgress.tsx": "Displays survey step progress and percentage using a progress bar.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating and refetching dependent queries when it updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login flow, and error handling.",
  "frontend/src/hooks/useInView.ts": "A React hook using IntersectionObserver to report when an element enters the viewport, with options for threshold, root margin, and one-time triggering.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching career recommendations, managing career chat actions, and polling career messages through an actor API.",
  "frontend/src/index.css": "Tailwind CSS base styles defining light/dark themes, color tokens, utility classes, and reduced-motion behavior.",
  "frontend/src/main.tsx": "App entry point setting up React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/state/careerFlowStore.tsx": "Context store managing survey answers, flow state, and chat session identifiers for the career guidance process.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, shadows, and enabling plugins like typography and container queries.",
  "project_state.json": "Metadata describing the project’s purpose, architecture, existing features, and versioned state for the Career Path Finder app."
}